#!/bin/bash

clear
echo "=============================================="
echo "ファイルに対して何をしたいですか"
echo "=============================================="
echo "作成 : 1   複製 : 2   移動・名前変更 : 3"   
echo "フォルダ作成 : 4   削除 : 5"
echo "=============================================="
read nyuuryoku

# 入力された値に応じて対応したシェルを実行する
case "$nyuuryoku" in
    1)
        echo "空ファイルを作成する場合：touch"
        ;;
    2)
        echo "ファイルやディレクトリをコピーする場合：cp"
        ;;
    3)
        echo "ファイルやディレクトリを移動・名前変更する場合：mv"
        ;;
    4)
        echo "新しいフォルダを作成する場合：mkdir"
        ;;
    5)
        echo "ファイルやディレクトリを削除する場合：rm"
        ;;
    *)
        echo "エラー: 1から5の数値を入力してください。"
        exit 1
        ;;
esac