#!/bin/bash

clear
echo "=============================================="
echo "文字列をどう操作したいですか"
echo "=============================================="
echo "文字列の置換・変換 ： 1    文字列の切り出し ： 2"
echo "テキストエディタを使用した修正 ： 3"
echo "=============================================="
read nyuuryoku

# 入力された値に応じて対応したシェルを実行する
case "$nyuuryoku" in
    1)
        echo "文字列を置換・置換変換する場合：sed"
        ;;
    2)
        echo "文字列の特定列を切り出す場合：cut"
        ;;
    3)
        echo "テキストエディタを使用する場合：vi"
        ;;
    *)
        echo "エラー: 1から3の数値を入力してください。"
        exit 1
        ;;
esac