#!/bin/bash

clear
echo "=============================================="
echo "どれを知りたいですか"
echo "=============================================="
echo "ハードリンクとシンボリックリンク　：　1     豆知識　：　2"
echo "=============================================="
read nyuuryoku

# 入力された値に応じて対応したシェルを実行する
case "$nyuuryoku" in
    1)
        echo "Linuxには、異なるファイル名で同一のファイルにアクセスする仕組みがある。"
        echo "仕組みには2パターン存在し、ハードリンクとシンボリックリンクという。"
        echo "ハードリンクとは、ぞれぞれのリンク自体がファイルに直接紐づいているリンクです。"
        echo "シンボリックリンクとは、リンク自体がファイルに直接紐づいているのではなく、リンク元に対して紐づいているリンクです。"
        echo "シンボリックリンクのイメージとしては、Windowsのリンクと同じようなものです。"
        echo "コマンドは下記"
        echo "ln リンク元 リンク先"
        echo "-s オプションを使用するとシンボリックリンク、オプションなしだとハードリンクになります。"
        ;;
    2)
        echo "特定の状況でコマンドを実行するとスパイダーマンの有名なセリフが表示されることも..."
        ;;
    *)
        echo "エラー: 1から5の数値を入力してください。"
        exit 1
        ;;
esac